In [14]:
import pandas as pd
import numpy as np

a = np.random.randint(0, 10, 24).reshape(4,6)
df = pd.DataFrame(a, index=list("가나다라"), columns=list("ABCDEF"))
df

   A  B  C  D  E  F
가  4  1  1  1  3  2
나  5  5  7  5  8  8
다  9  0  0  3  9  1
라  5  0  6  0  5  6

In [15]:
df

   A  B  C  D  E  F
가  4  1  1  1  3  2
나  5  5  7  5  8  8
다  9  0  0  3  9  1
라  5  0  6  0  5  6

In [16]:
df["A"]

가    4
나    5
다    9
라    5
Name: A, dtype: int32

In [17]:
df[["B", "C", "D"]]

   B  C  D
가  1  1  1
나  5  7  5
다  0  0  3
라  0  6  0

In [18]:
df

   A  B  C  D  E  F
가  4  1  1  1  3  2
나  5  5  7  5  8  8
다  9  0  0  3  9  1
라  5  0  6  0  5  6

In [19]:
df.loc["가", "A"]

4

In [20]:
df.loc["가":"다", "A":"D"]

   A  B  C  D
가  4  1  1  1
나  5  5  7  5
다  9  0  0  3

In [23]:
df.loc["가":"다", ["A", "E", "E", "B"]]

   A  E  E  B
가  4  3  3  1
나  5  8  8  5
다  9  9  9  0

In [24]:
df.loc["가":"다"]

   A  B  C  D  E  F
가  4  1  1  1  3  2
나  5  5  7  5  8  8
다  9  0  0  3  9  1

In [25]:
df.iloc[0]

A    4
B    1
C    1
D    1
E    3
F    2
Name: 가, dtype: int32

In [27]:
df.iloc[0,0]

4

In [28]:
df.iloc[0:3, 0:5]

   A  B  C  D  E
가  4  1  1  1  3
나  5  5  7  5  8
다  9  0  0  3  9

In [30]:
df.iloc[0:3, [1,3,3,1]]

   B  D  D  B
가  1  1  1  1
나  5  5  5  5
다  0  3  3  0

In [31]:
df

   A  B  C  D  E  F
가  4  1  1  1  3  2
나  5  5  7  5  8  8
다  9  0  0  3  9  1
라  5  0  6  0  5  6

In [33]:
df.drop("D", axis=1)
# 행 : axis=0 (axis 옵션 없으면 기본값)
# 열 : axis=1

   A  B  C  E  F
가  4  1  1  3  2
나  5  5  7  8  8
다  9  0  0  9  1
라  5  0  6  5  6

In [35]:
df.loc[["가", "나", "다"], list("BDEF")]

   B  D  E  F
가  1  1  3  2
나  5  5  8  8
다  0  3  9  1

In [37]:
df.iloc[:3, 1:].drop("C", axis=1)

   B  D  E  F
가  1  1  3  2
나  5  5  8  8
다  0  3  9  1